<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html dir="ltr" lang="ru">
<head>
    <meta charset="utf-8" />
    <title>Mageia Цели</title>
    <meta name="description" content="Mageia is new community-based Linux distribution." />
    <meta name="keywords" content="mageia, Цели" />
    <meta name="author" content="Mageia" />
    <link rel="stylesheet" type="text/css" href="/g/style/all.css" />
    <?php include '../../../analytics.php'; ?>
</head>
<body>
    <?php include '../../../langs.php'; ?>

    <div id="doc" class="yui-t7">
        <div id="hd" role="banner"><h1><a id="logo" href="/"><span>Mageia</span></a> <span class="lsep">|</span> <span class="subh">Цели</span></h1></div>
        <div id="bd" role="main">
            <div class="yui-g">
                <div class="para values">
                    <h2>MMageia — это Социальное ПО</h2>

                    <ul>
                        <li>Мы, как Сообщество, ценим <i>наших пользователей</i>. Мы всегда будем находиться в контакте с нашими пользователями, так как они являются такой же большой частью сообщества, как и создатели и организаторы.</li>
                        <li>Мы понимаем что наши самые ценные активы это люди и Сообщество.</li>
                        <li>WМы всегда будем дистрибутивом сообщества, ценящим всех вносящих вклад членов сообщества.</li>
                        <li>Мы будем «включительным» дистрибутивом, дабы быть уверенными что каждый член сообщества будет услышан.</li>
                        <li>Мы высоко ценим дружубу и будем способствовать социальным взаимоотношениям между людьми.</li>
                        <li>Мы ценим честность, сообщество, доверие и всегда будем придерживаться самых высоких этических стандартов.</li>
                        <li>Кроме всего прочего, мы будем довольны собой :-) .</li>
                        <li>Мы будем стремиться поддерживать волю, как нашу собственную, так и более широкого сообщества Open Source.</li>
                        <li>Мы будем помогать и поддерживать друг друга. Если что-то не так, мы будем предпренимать необходимые шаги чтобы найти наилучшее решение и использовать его.</li>
                    </ul>
                    
                    <h2>Mageia — это Мощная Технология.</h2>
                    <ul>
                        <li>Мы, как Свободное Программное Обеспечение, и как Операционная Система, будем постоянно вводить новшевства, чтобы являться наилучшим выбором в компьютерных технологиях.</li>
                        <li>Мы будем всегда находиться в курсе последних тенденций сообщеста Open Source, разумно поддерживая баланс между улучшениями и  надежностью в наших релизах.</li>
                        <li>Мы будем находиться в резонансе с нашим Сообществом и всегда стремиться быть лидером в области совместнх разработок.</li>
                        <li>Мы будем поддерживать наших пользователей в стремлении быть лучшими из лучших на своих компьютерах.</li>
                        <li>Мы будем стремиться к простоте в использовании, но также предлагать целый набор инноваций, подходящих как для новичков, так и для продвинутых пользователей.</li>
                    </ul>
                    
                    <h2>Mageia — это Знания</h2>
                    <ul>
                        <li>Программное Обеспечение является неразнывной частью нашей повседневной жизни, почти в каждом нашем взаимодействии как дома так и во всем окружающем мире, и в его основе лежит исходный код. Мы будем стремиться к пониманию данного факта и того, как он влияет на нашу повседневную жизнь.</li>
                        <li>Мы будем усиливать нашу пользовательскую базу, раскрывая тайны продвинутых технологии.</li>
                        <li>Мы признаем что мы тоже люди. Неудачи и недостатки случается, и приносят свои последствия. Мы будем принимать это во внимание в нашем Программном Обеспечении и жизни, также как и стремление к счастью. Мы будем развиваться.</li>
                        <li>Мы верим что нет ничего столь прекрасного, как понимание Программного Обеспечения, которое вы используете в повседневной жизни. Таким образом мы будем открыто информировать людей о Свободном Программном Обеспечении, нашем Сообществе, и нашей Операционной Системе.</li>
                    </ul>
                    
                    <h2>Mageia — это Качество</h2>
                    <ul>
                        <li>Mageia будем основываться на хороших требованиях к качеству и стабильности.</li>
                        <li>Mageia будет соответствовать стандартам Open Source.</li>
                        <li>Mageia всегда будет соблюдать высокий уровень безопасности и конфиденциальности, дабы защитить данные наших пользователей.</li>
                    </ul>
                    
                    <h2>Mageia — это Открытые Взаимоотношения</h2>
                    <ul>
                        <li>Мы будем обеспечивать будущее дистрибутива через сообщество.</li>
                        <li>Мы будем сотрудничать с другими открытыми дистрибутивами, и разработчиками ядра, для внесения вклада в исходный код.</li>
                        <li>Мы будем работать в сотрудничестве с другими проектами Open Source.</li>
                        <li>Мы будем приветствовать любые коммерческие предприятия как часть сообщества.</li>
                        <li>Mageia всегда будет основанна на Открытом Программном Обеспечении. Тем не менее, она также будет открыта и для Закрытого Программного Обеспечения, чтобы предоставлять альтернативы нашшим пользователям в их разнообразных потребностях и ожиданиях.</li>
                        <li>Mageia всегда будет коллективным, международным и организованным проектом, представляющим наше многогранное сообщество.</li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
</body>
</html>