<!DOCTYPE html>
<html dir="ltr" lang="el">
<head>
    <meta charset="utf-8" />
    <title>Mageia αξίες</title>
    <meta name="description" content="Η Mageia είναι η νέα κοινοτική διανομή Linux." />
    <meta name="keywords" content="mageia, αξίες" />
    <meta name="author" content="Mageia" />
    <link rel="stylesheet" type="text/css" href="/g/style/all.css">
    <?php include '../../../analytics.php'; ?>
</head>
<body>
    <?php include '../../../langs.php'; ?>
    <div id="doc" class="yui-t7">
        <div id="hd" role="banner"><h1><a id="logo" href="/"><span>Mageia</span></a> <span class="lsep">|</span> <span class="subh">αξίες</span></h1></div>
        <div id="bd" role="main">
            <div class="yui-g">
                <div class="para values">
                    <h2>Η Mageia είναι κοινωνικό λογισμικό</h2>

                    <ul>
                        <li>Εμείς, ως κοινότητα, θα εκτιμούμε τους χρήστες μας. Θα είμαστε πάντα σε επαφή με την βάση χρηστών μας, γιατί είναι μέρος της κοινότητας όπως οι κατασκευαστές και οι διοργανωτές.</li>
                        <li>Αντιλαμβανόμαστε ότι το πολυτιμότερο για μας είναι οι άνθρωποι και η κοινότητα.</li>
                        <li>Θα είμαστε πάντα μια κοινοτική διανομή, εκτιμώντας όλες τις συνεισφορές της κοινότητας.</li>
                        <li>Θα είμαστε μια διανομή χωρίς αποκλεισμούς, εξασφαλίζοντας ότι όλοι στην κοινότητα μπορούν να κάνουν τη φωνή τους να ακουστεί.</li>
                        <li>Θα εκτιμούμε την φιλία και θα προωθούμε την κοινωνική αλληλεπίδραση μεταξύ των ανθρώπων.</li>
                        <li>Θα εκτιμούμε την ακεραιότητα, την κοινότητα, την εμπιστοσύνη και θα τηρούμε πάντα τα υψηλότερα ηθικά πρότυπα.</li>
                        <li>Θέλουμε πάνω απ' όλα να περάσουμε καλά :-) .</li>
                        <li>Θα προσπαθούμε να διατηρήσουμε την καλή θέληση και από την πλευρά μας αλλά και από την κοινότητα.</li>
                        <li>Θα βοηθάμε και θα υποστηρίζουμε ο ένας τον άλλο. Όταν κάτι δεν είναι σωστό, θα ενεργούμε κατάλληλα για την επίλυσή του.</li>
                    </ul>
                    
                    <h2>Mageia ως ισχυρή τεχνολογία</h2>
                    <ul>
                        <li>Εμείς, ως ελεύθερο λογισμικό και ως λειτουργικό σύστημα, θα καινοτομούμε συνεχώς για να είμαστε η πιο προηγμένη τεχνολογικά επιλογή.</li>
                        <li>Θα είμαστε ενημερωμένοι με τις τελευταίες τάσεις στο ανοιχτό λογισμικό, επιλέγοντας την ισορροπία ανάμεσα στο μοντέρνο λογισμικό και την σταθερότητα στις εκδόσεις μας.</li>
                        <li>Θα διατηρούμε την κοινότητά μας ζωντανή, πάντα με στόχο να ανοίγουμε τον δρόμο στην από κοινού ανάπτυξη.</li>
                        <li>Θα ενθαρρύνουμε τους χρήστες μας ώστε να έχουν την καλύτερη εμπειρία με τον υπολογιστή τους.</li>
                        <li>Θα προσπαθούμε για την ευκολία στη χρήση, αλλά επίσης στο να προσφέρουμε ένα πλήρες σύνολο καινοτομιών για νέους αλλά και έμπειρους χρήστες.</li>
                    </ul>
                    
                    <h2>Η Mageia είναι γνώση</h2>
                    <ul>
                        <li>Το λογισμικό είναι αναπόσπαστο κομμάτι στην καθημερινή μας ζωή, σχεδόν σε κάθε αλληλεπίδραση στο σπίτι και στο περιβάλλον, και η καρδιά του είναι  κώδικας υπολογιστών. Θα προσπαθούμε να τον καταλάβουμε, και πως δουλεύει στην καθημερινή μας ζωή.</li>
                        <li>Θα ενδυναμώνουμε τους χρήστες μας αποκαλύπτοντάς τους εξελιγμένες τεχνολογίες.</li>
                        <li>Αναγνωρίζουμε ότι είμαστε άνθρωποι και φυσικό είναι να κάνουμε σφάλματα και να έχουμε αποτυχίες. Θα το λάβουμε υπόψη μας στο λογισμικό και στην ζωή μας, και στην επιδίωξη της ευτυχίας. Εξελισσόμαστε.</li>
                        <li>Πιστεύουμε ότι δεν υπάρχει τίποτα τόσο όμορφο όσο η κατανόηση του λογισμικού που χρησιμοποιείτε στην καθημερινή σας ζωή. Ως εκ τούτου, θα εκπαιδεύσουμε τους ανθρώπους ανοιχτά για το ελεύθερο λογισμικό, την κοινότητά μας, και το λειτουργικό μας σύστημα.</li>
                    </ul>
                    
                    <h2>Η Mageia είναι ποιότητα</h2>
                    <ul>
                        <li>Η Mageia θα βασίζεται σε υψηλές απαιτήσεις ποιότητας/σταθερότητας.</li>
                        <li>Η Mageia θα είναι συμβατή με τα πρότυπα του ανοιχτού λογισμικού.</li>
                        <li>Η Mageia θα τηρεί υψηλά πρότυπα ασφαλείας και προστασίας του ιδιωτικού απορρήτου για την προστασία των δεδομένων των χρηστών μας.</li>
                    </ul>
                    
                    <h2>Η Mageia είναι ανοιχτές σχέσεις</h2>
                    <ul>
                        <li>Θα διασφαλίσουμε το μέλλον της διανομής μέσω της κοινότητας της.</li>
                        <li>Θα συνεργαζόμαστε με άλλες διανομές ανοιχτού κώδικα και με προγραμματιστές του πυρήνα και του κορμού του λειτουργικού με την συνεισφορά κώδικα.</li>
                        <li>Θα συνεργαζόμαστε με άλλα έργα ανοιχτού κώδικα.</li>
                        <li>Θα καλωσορίζουμε κάθε εμπορική επιχείριση ως μέρος της κοινότητάς μας.</li>
                        <li>Η Mageia θα βασίζεται πάντα σε ανοιχτού κώδικα λογισμικό. Ωστόσο, θα είναι ανοιχτή σε συνεισφορές μη ανοιχτού κώδικα, για την παροχή εναλλακτικών λύσεων και για την κάλυψη των αναγκών των χρηστών μας.</li>
                        <li>Η Mageia θα είναι πάντα συλλογική, διεθνής και οργανωμένη προσπάθεια, αντιπροσωπευτική του πλουραρισμού της κοινότητάς μας.</li>
                    </ul>
                </div>
            </div>
        </div>
    </div>
</body>
</html>
