<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html dir="ltr" lang="el">
<head>
    <meta charset="utf-8" />
    <title>Κώδικας συμπεριφοράς - Mageia</title>
    <meta name="description" content="Η Mageia είναι μια νέα κοινοτική διανομή Linux." />
    <meta name="keywords" content="mageia, αξίες, συμπεριφορά, κανόνες" />
    <meta name="author" content="Mageia" />
    <link rel="stylesheet" type="text/css" href="/g/style/all.css" />
    <?php include '../../../analytics.php'; ?>
</head>
<body>
    <?php include '../../../langs.php'; ?>
    <div id="doc" class="yui-t7">
        <div id="hd" role="banner"><h1>Mageia <span>| Κώδικας συμπεριφοράς</span></h1></div>
        <div id="bd" role="main">
            <div class="yui-g">
                <div class="para codeofconduct">
                    <div id="preamble">

                    <p>Το έργο Mageia είναι μια ζωντανή κοινότητα, ανοιχτή σε όλους. Επιθυμούμε αυτή η κοινότητα να είναι ένα όμορφο μέρος για τους νέους και τους παλιούς χρήστες, όπου ο καθένας θα αισθάνεται άνετα και καλοδεχούμενος, ανεξάρτητα από τον αριθμό και τον τύπο των συνεισφορών του.</p>

                    <p>Στην κοινότητα της Mageia, οι συμμετέχοντες από όλο τον κόσμο συνεργάζονται για την δημιουργία ενός ελεύθερου λειτουργικού συστήματος. Αυτό είναι δυνατό με την αλληλοϋποστήριξη, την σκληρή δουλειά, και τον ενθουσιασμό χιλιάδων ανθρώπων, αυτών που δημιουργούν και χρησιμοποιούν την Mageia αλλά και των μελών άλλων έργων ελεύθερου λογισμικού.</p>

                    <p>Αυτό το έγγραφο δείχνει πως μπορούν οι συμμετέχοντες στη Mageia να συνεργαστούν αποτελεσματικά σε μια θετική ατμόσφαιρα, και να εξηγήσει πως μπορούμε να βοηθήσουμε ο ένας τον άλλο.</p>

                    <p>Αυτός ο κώδικας συμπεριφοράς είναι κοινός από όλους τους συνεισφέροντες και τους χρήστες που εμπλέκονται στο έργο Mageia και στις κοινοτικές υπηρεσίες του.</p>
                    </div>

                    <div id="overview">
                    <h2 class="be">Επισκόπηση</h2>

                    <p>Αυτός ο κώδικας συμπεριφοράς παρουσιάζει μια σύνοψη των κοινών αξιών και της κοινής σκέψης στην κοινότητά μας. Αυτές οι βασικές κοινωνικές επιταγές που κρατούν συνεκτικό το έργο μας συμπεριλαμβάνουν:</p>
                    <ul>
                        <li><a href="#be_considerate">Να είστε διακριτικοί</a>,</li>
                        <li><a href="#be_respectful">Να είστε σεβαστικοί</a>,</li>
                        <li><a href="#be_collaborative">Να είστε συνεργάσιμοι</a>,</li>
                        <li><a href="#be_pragmatic">Να είστε πραγματιστές</a>,</li>
                        <li><a href="#support">Βοηθήστε τα άλλα μέλη στην κοινότητα</a>,</li>
                        <li><a href="#get_support">Λάβετε βοήθεια από άλλους στην κοινότητα</a>.</li>
                    </ul>

                    <p>Αυτός ο κώδικας συμπεριφοράς δείχνει την αναμενόμενη διαγωγή από τα μέλη της κοινότητας Mageia στα φόρουμ, λίστες ταχυδρομείου, wiki, ιστοσελίδες, κανάλια IRC, δημόσιες συναντήσεις ή ιδιωτική αλληλογραφία σχετικά με το έργο και τις υπηρεσίες της Mageia. Η κοινότητα ενεργεί σύμφωνα με τα πρότυπα που ορίζονται στον παρόντα Κώδικα Συμπεριφοράς και υποστηρίζει τον κώδικα αυτό προς όφελος της κοινότητας. Οι ηγέτες της κάθε ομάδας, ως συντονιστές στις λίστες ταχυδρομείου, κανάλια IRC, φόρουμ, κλπ, έχουν το δικαίωμα να αναστείλουν την πρόσβαση σε όποιον παραβιάζει συστηματικά τον κώδικα συμπεριφοράς μας και αν κριθεί απαραίτητο μπορεί να τεθεί το θέμα στο συμβούλιο της Mageia για να παρθεί η τελική απόφαση.</p>
                    </div>

                    <h2 id="be_considerate" class="be">Να είστε διακριτικοί.</h2>

                    <p>Οι ενέργειές σας και το έργο σας θα επηρεάσουν άλλους ανθρώπους, και με τη σειρά σας θα εξαρτηθείτε από τα έργα και τις ενέργειες των άλλων. Κάθε απόφαση που παίρνετε θα επηρεάσει τα άλλα μέλη της κοινότητας. Περιμένουμε να εξετάζετε αυτές τις συνέπειες όταν λαμβάνετε αποφάσεις.</p>

                    <p>Ως συνεισφέρων, σιγουρευτείτε ότι η εργασία σας είναι για το συμφέρον των άλλων και να έχετε υπόψη σας ότι οι ενέργειές σας τους επηρεάζουν. Αναμένεται επίσης ότι θα σέβεστε τον προγραμματισμό της ανάπτυξης και τις οδηγίες.</p>

                    <p>Ως χρήστης, να έχετε υπόψη σας ότι οι συνεισφέροντες εργάζονται επιμελώς στις συνεισφορές τους για τη Mageia και είναι πολύ υπερήφανοι. Αν είστε απογοητευμένοι, τα προβλήματά σας είναι πιθανότερο να επιλυθούν εάν παρέχετε ακριβείς πληροφορίες και ζητώντας ευγενικά στα άτομα που εμπλέκονται.</p>

                    <h2 id="be_respectful" class="be">Να είστε σεβαστικοί.</h2>

                    <p>Προκειμένου να διατηρηθεί μια υγιής κοινότητα Mageia, τα μέλη της πρέπει να αισθάνονται άνετα και αποδεκτά. Γι 'αυτό είναι επιτακτική ανάγκη να φέρεστε στους άλλους με σεβασμό. Σε περίπτωση διαφωνίας, σκεφτείτε εκ των προτέρων ότι οι άνθρωποι είναι καλοπροαίρετοι.</p>

                    <p>Δεν μπορούμε να ανεχθούμε τις προσωπικές επιθέσεις, τον ρατσισμό, τον σεξισμό ή οποιαδήποτε άλλη μορφή διάκρισης. Οι διαφωνίες είναι αναπόφευκτες μερικές φορές, αλλά ο σεβασμός για τις άλλες απόψεις, θα σας επιτρέψει σταδιακά να κερδίσετε τον σεβασμό της δικής σας άποψης. Σεβαστείτε τους άλλους, το έργο τους, την συνεισφορά τους και να έχετε ως προϋπόθεση το καλοπροαίρετο κίνητρό τους, θα έχει ως αποτέλεσμα τα μέλη της κοινότητας να αισθάνονται άνετα και αποδεκτά, και θα είναι προς όφελος για ακόμα μεγαλύτερη κινητοποίηση και παραγωγικότητα.</p>

                    <p>Περιμένουμε από τα μέλη της κοινότητάς μας να σέβονται τους συνεργάτες τους στις συναλλαγές τους, τους χρήστες, καθώς και τις άλλες κοινότητες. Έχετε υπόψη σας ότι η Mageia είναι ένα διεθνές έργο και ίσως να μην γνωρίζετε ότι ορισμένα σημεία είναι σημαντικά σε άλλους πολιτισμούς.</p>

                    <h2 id="be_collaborative" class="be">Να είστε συνεργάσιμοι.</h2>

                    <p>Το κίνημα του ελεύθερου λογισμικού εξαρτάται από τη συνεργασία: συμβάλλει στη μείωση της επανάληψης των προσπαθειών με παράλληλη βελτίωση της ποιότητας του λογισμικού. Προς αποφυγή παρεξηγήσεων, προσπαθήστε να είστε σαφείς και συνοπτικοί όταν ζητάτε ή δίνετε βοήθεια. Να έχετε υπόψη σας ότι είναι εύκολο να παρανοήσετε μηνύματα ηλεκτρονικού ταχυδρομείου (ειδικά όταν δεν είναι γραμμένα στη μητρική σας γλώσσα). Ζητήστε διευκρινήσεις αν η έννοια είναι ασαφής, θυμηθείτε τον πρώτο κανόνα: οι άνθρωποι είναι καλοπροαίρετοι.</p>

                    <p>Ως συνεισφέρων, θα πρέπει να στοχεύετε στη συνεργασία με τα άλλα μέλη της κοινότητας, αλλά και με άλλες κοινότητες (π.χ. έργα upstream) που μπορεί να ενδιαφέρονται για την εργασία σας ή να εξαρτώνται από αυτή. Η εργασία σας πρέπει να είναι διαφανής και να παραχωρηθεί στην κοινότητα όσο το δυνατόν ταχύτερα (ακόμη και αν δεν έχει ολοκληρωθεί). Αν θέλετε να εργαστείτε πάνω σε κάτι νέο στα υπάρχοντα έργα, ενημερώστε όσους εμπλέκονται σε αυτά τα έργα για τις ιδέες σας και την πρόοδό σας.</p>

                    <p>Δεν είναι πάντα δυνατό να συμφωνούν όλοι σχετικά με την υλοποίηση μιας ιδέας, δεν είναι απαραίτητο να πάρετε την συγκατάθεση όλων πριν ξεκινήσετε. Αλλά σιγουρευτείτε ότι ενημερώνετε πάντα τους άλλους σχετικά με την εργασία σας και να την δημοσιεύσετε, ώστε οι άλλοι να μπορούν να την δοκιμάσουν, συζητώντας και συμβάλλοντας στην προσπάθειά σας.</p>

                    <p>Οι συντελεστές του κάθε έργου έρχονται και παρέρχονται. Όταν αφήνετε ένα έργο ή αποδεσμεύστε - ολοκληρωτικά ή εν μέρει, θα πρέπει να είστε υπερήφανοι για όσα κάνατε και να ενεργήσετε υπεύθυνα προς εκείνους που θα έρθουν μετά από εσάς να συνεχίσουν το έργο.</p>

                    <p>Ως χρήστης, οι παρατηρήσεις σας είναι σημαντικές, όπως και η μορφή τους. Αγενείς παρατηρήσεις μπορούν να βλάψουν και να αποθαρρύνουν άλλα μέλη της κοινότητας, ενώ οι συζητήσεις για τα προβλήματα μπορεί να αποφέρουν θετικά αποτελέσματα. Μια ενθαρρυντική λέξη είναι πολύ αποτελεσματική!</p>


                    <h2 id="be_pragmatic" class="be">Να είστε πραγματιστές.</h2>

                    <p>Η Mageia είναι μια πρακτική κοινότητα.</p>
                    <p>Εκτιμούμε τα απτά αποτελέσματα πέρα από την κατοχή της τελευταίας λέξης σε μια συζήτηση. Υπερασπιζόμαστε τις θεμελιώδες μας αξίες όπως η ελευθερία και η συνεργασία με σεβασμό, αλλά δεν θα αφήσουμε επιχειρήματα σχετικά με δευτερεύοντα θέματα να υπερισχύσουν στον τρόπο που θα επιτευχθούν καλύτερα αποτελέσματα. Είμαστε ανοιχτοί σε προτάσεις και χαιρετίζουμε λύσεις, ανεξάρτητα από την προέλευσή τους. Σε περίπτωση αμφιβολίας, προτιμήστε τις λύσεις που λειτουργούν και όχι αυτές που έχουν θεωρητική αξία αλλά χωρίς εφαρμογή. Χρησιμοποιήστε τα εργαλεία και τις μεθόδους που βοηθούν στην υλοποίηση της εργασίας. Αφήστε αυτούς που κάνουν το έργο να λάβουν τις αποφάσεις. Εάν ανακύψουν φαινομενικά ανυπέρβλητα προβλήματα, συζητήστε με τους επικεφαλής της εκάστοτε ομάδας. Εάν είναι απαραίτητο, συμβουλευτείτε το Συμβούλιο Mageia.</p>


                    <h2 id="support" class="be">Βοηθήστε τα άλλα μέλη στην κοινότητα.</h2>

                    <p>Η κοινότητά μας ενισχύεται από τον αμοιβαίο σεβασμό, τη συνεργασία και τη ρεαλιστική και υπεύθυνη συμπεριφορά. Μερικές φορές αυτές οι αξίες πρέπει να υπερασπίζονται, όταν τα άλλα μέλη της κοινότητας χρειάζονται βοήθεια.</p>

                    <p>Όταν ένα άτομο δέχεται επίθεση, σκεφτείτε πρώτα πως μπορείτε να τον βοηθήσετε ο ίδιος. Αν νομίζετε ότι η κατάσταση είναι πέραν των δυνατοτήτων σας για ατομική βοήθεια, επικοινωνήστε με το θύμα προσωπικά και ρωτήστε το αν κάποια μορφή επίσημης παρέμβασης είναι απαραίτητη. Ομοίως, θα πρέπει να παρέχετε βοήθεια σε κάθε πρόσωπο που εμφανίζεται σε κίνδυνο, είτε από επαγγελματικό άγχος ή από προσωπικά προβλήματα.</p>

                    <p>Όταν προκύπτουν προβλήματα, η πρώτη ενέργεια είναι να υπενθυμίσετε με σεβασμό στα άτομα που εμπλέκονται τον κώδικα συμπεριφοράς μας. Οι ηγέτες ορίζονται από τις πράξεις τους και μπορούν να δώσουν το καλό παράδειγμα εργαζόμενοι για την επίλυση των προβλημάτων στο πνεύμα του εν λόγω κώδικα συμπεριφοράς πριν πάρουν διαστάσεις.</p>


                    <h2 id="get_support" class="be">Λάβετε βοήθεια από άλλους στην κοινότητα.</h2>

                    <p>Διαφωνίες, είτε σε πολιτικό είτε τεχνικό επίπεδο, είναι πολύ συνηθισμένες και η κοινότητα μας δεν αποτελεί εξαίρεση. Ο στόχος δεν είναι να αποφευχθούν οι διαφωνίες και άλλες διαφορές, αλλά να αντιμετωπιστούν εποικοδομητικά. Θα πρέπει να απευθυνθείτε στην κοινότητα για την παροχή συμβουλών και την επίλυση των διαφορών και, όπου αυτό είναι δυνατό, να συζητήσετε με την ομάδα του που εμπλέκεται άμεσα.</p>

                    <p>Όπου είναι δυνατό αποφεύγετε την μετατροπή μιας διαφωνίας σε ένα δημόσιο τσακωμό. Εάν είναι απαραίτητο, ζητήστε ένα διαμεσολαβητή και προσπαθήστε να επιλύσετε τις διαφορές σε ένα περιβάλλον με λιγότερο φανατισμό. Αν νομίζετε ότι εσείς ή η εργασία σας δέχεται επίθεση, μην ανταποκριθείτε έντονα αμέσως: αναπνεύστε, οπισθοχωρήστε. Σκεφτείτε να κάνετε μία 24ωρη ανάπαυλα όταν το λεξιλόγιο γίνεται παθιασμένο, μια περίοδος χαλάρωσης είναι μερικές φορές αρκετή για να ηρεμήσουν τα πνεύματα. Εάν δεν είναι δυνατό να συγκλίνουν οι απόψεις σας, σας προσκαλούμε να μοιραστείτε τις ιδέες σας και την εργασία σας έτσι ώστε να μπορούν να αξιολογηθούν.</p>

                    <p class="license">Αυτό το έγγραφο υπόκειται στην άδεια χρήσης <a href="http://creativecommons.org/licenses/by-sa/3.0/us/deed.el">Αναφορά προέλευσης - Παρόμοια Διανομή 3.0 Μη εισαγόμενο</a> (<a href="http://wiki.mandriva.com/en/Code_of_Conduct" rel="nofollow">προηγούμενη έκδοση</a>).</p>
                </div>
            </div>
        </div>
    </div>
</body>
</html>