<!DOCTYPE html>
<html dir="ltr" lang="zh-tw">
<head>
    <meta charset="utf-8">
    <title>Code of Conduct - Mageia</title>
    <meta name="description" content="Mageia is new community-based Linux distribution.">
    <meta name="keywords" content="mageia, values, conduct, rules">
    <meta name="author" content="Mageia">
    <link rel="stylesheet" type="text/css" href="/g/style/all.css" />
    <?php include '../../../analytics.php'; ?>
</head>
<body>
    <?php include '../../../langs.php'; ?>
    <div id="doc" class="yui-t7">
        <div id="hd" role="banner"><h1>Mageia <span>| Code of Conduct</span></h1></div>
        <div id="bd" role="main">
            <div class="yui-g">
                <div class="para codeofconduct">
                    <div id="preamble">
<p>Mageia 計畫是一個對所有人開放的活躍社群。我們希望不管是新加入者或者是現有的成員，這個社群都可以讓所有人感到舒適並且接受任何程度與型態的貢獻。</p>
<p>
在
Mageia 社群裡面，世界各地的參與者一起創造了一個自由軟體的作業系統。包括了創造與使用 Mageia
的人們，其他使用自由軟體計畫的成員，他們的支援、辛勤的工作與熱誠讓這樣的計畫成為可能的事實。</p>
<p>
這份文件提供了
一些導引，關於確保 Mageia 參與者應如何有效地在一個正面且激勵性的環境當中互相合作，並且解釋了我們應該如何支援其他人。</p>
<p>
本行為準則要分
享給參加 Mageia 計畫與其社群服務的所有貢獻者和使用者。</p>
</div>
<div id="overview">
<h2 class="be">概述</h2>
<p>
本行為準則概要
地提供了我們社群所共享的價值觀與「常識」看法。讓我們的計畫能團結一致所必備的基本準則包括：</p>
<ul>
  <li><a href="#be_considerate">互相著想。</a></li>
  <li><a href="#be_respectful">互相尊重。</a></li>
  <li><a href="#be_collaborative">互相合
作。</a></li>
  <li><a href="#be_pragmatic">秉
持務實。</a></li>
  <li><a href="#support">支援社群
中的其他人。</a></li>
  <li><a href="#get_support">從
社群中的其他人獲得支援。</a></li>
</ul>
<p>
本行為準則表明
了我們對於 Mageia 社群成員一致同意的行為標準，無論是在任何討論區、郵件論壇、wiki、網站、IRC
頻道、公開會議或私人信件往來，只要是和 Mageia
計畫及其服務有關均適用。社群根據寫於本行為準則中的標準行事，並且會為了社群的利益來維護這些標準。對於任何堅持要破壞我們共同行為準則的人，所有
Mageia 團隊的領導人都擁有中止他們存取權的權利，或是如果有需要的話，可以把該問題提請 Mageia 委員會做最後裁決。</p>
</div>
<h2 id="be_considerate" class="be">互相著想。</h2>
<p>
您<span>的
行動及成果</span>會影響並被其他人所使用，而之後您也會反過來需要依靠其他人的成果及行動。您所做的任何決定都將影響其他的社群成員，而我們期望
您在做出決定時考慮到那些結果。</p>
<p>
身為貢獻者的
話，要確認您對其他人的成果有給予完整的交代，並牢記您的更改會如何影響其他人。我們也期待您試著遵照計畫進度表和指導方針。</p>
<p>身為使用者的
話，要記得貢獻者對 Mageia
努力地貢獻且感到非常自豪。如果您因為某特定問題感到沮喪的話，若您能夠提供準確且有用的訊息給所有相關人員，那麼您的問題會更有可能解決。</p>
<h2 id="be_respectful" class="be">互相尊重。</h2>
<p>
為了使
Mageia
社群保持健康，其成員必須感到舒適和被接納。要達成這個的話互相尊重是絕對必要的。若有任何意見不同的情形發生時，您應先假定人們並無惡意。</p>
<p>我們不會容忍人
身攻擊、種族主義、性別歧視或任何其他形式的歧視。意見分歧有時是不可避免的，但尊重別人的看法往往也會贏得別人尊重您自己的看法。尊重他人、他們的成
果、貢獻，並假定人們無惡意動機將使得社群成員感到舒適和安全，而且也會帶來更多的積極性和生產力。</p>
<p>我們期望我們的
社群成員在打交道時，要尊重其他的貢獻者、使用者以及社群。請記得 Mageia 是個國際性的計畫，而您對其他文化某些重要的層面可能不瞭解。</p>
<h2 id="be_collaborative" class="be">互相合作。</h2>
<p>
自由軟體的進展
仰賴著合作關係：這讓增進軟體品質的同時降低了重複的工作。為了避免誤會，在詢問以及給予協助的時候儘量保持清楚而且簡潔。請記住，誤會其他人電子郵件的
意思是很常發生的（特別是用非母語所撰寫的信件）。當你對某件事情覺得不清楚，請詢問關於該部分的說明，並且記住第一個前提：首先，假設對方是出於好意。</p>
<p>
作為貢獻者，你
應該專注於跟社群成員、還有其他你關心的、或者需要你的貢獻的其他社群（舉例來說，上游計畫的社群）合作。你的成果應該是透明公開，而且能儘快回饋到社群
裡面（即使並非完成品）。如果你希望在現存的計畫裡面做出新的貢獻，讓這些計畫的團隊知道你的計畫與進度。</p>
<p>
關於新點子的實
作要達到共識有的時候並不容易，所以不要覺得在你開始工作前達到共識是你的責任。儘管如此，請總是確保讓外界了解你的進度，並且將它公開讓其他人可以測
試、討論、並且對你的努力可以提出貢獻。</p>
<p>
對每個計劃來
說，貢獻者們來來去去。當你離開或者暫時停止在某個計劃上面的付出，不管貢獻多少，你都應該對你的貢獻感到驕傲，同時你也應對該計畫後繼者負起交接責任。<br>
</p>
<p>
作為使用者，你
的意見回饋是重要的，而且回饋時的表達形式也同等重要。思慮不周的評論可讓人苦惱，也讓其他的社群成員失去動力，但對問題的周詳討論卻可以帶來正面的結
果。一句鼓勵的話可以創造奇蹟。<br>
</p>
<h2 id="be_pragmatic" class="be">秉持務實。</h2>
<p>
Mageia
是個務實的社群。</p>
<p>
我們重視實際的
結果勝過於討論中的最後決定。我們捍衛我們的核心價值觀如自由和互相尊重的合作，但我們不會讓小問題的爭論阻擋了實現更重要成果的去路。我們對於建議的態
度是開放的，而且也歡迎解決方案，不論其來源為何。當有疑問時，支持能把事情解決的方案，勝過於雖有理論價值，但卻尚未實現的方案。使用能幫助完成工作的
工具和方法。讓做該工作的人下決定。如果出現一些看似無法協調的問題，諮詢有關的小組組長。如果有必要，可諮詢 Mageia 委員會。<br>
</p>
<h2 id="support" class="be">支
援社群中的其他人。</h2>
<p>
我們的社群是因
相互尊重、合作和負責任、務實的態度而強健的。有時候這些價值是必須被捍衛的，而其他社群成員可能也需要幫助。</p>
<p><br>
如果你看到其他人被攻擊，先想想你能如何提供個人的幫助。如果你覺得情況已超出你個人的能力，請私下向受害者詢問是否需要官方某種形式上的介入。同樣地，
你應該幫助看起來快要累垮的任何人，無論是因為工作上的壓力或是個人問題。<br>
</p>
<p>當問題發生時，可考慮有禮貌地提醒那些與我們共同行為準則有關的人，來作為第一個行動。領導者的重要就在於他們的行動，他們能幫忙以身作則，在問題惡化前秉持著行為準則的精神把問題解決。</p>
<h2 id="get_support" class="be">從社群中的其他人獲得支援。</h2>
<p>政治上和技術上的意見不合總是在發生。我們的社群也不例外。我們的目標不是要避免意見不合或是不同的看法，而是要具建設性地解決它們。你應該向社群徵求意見、解決不合，並在可能的情況下，諮詢最直接相關的小組。</p>
<p class="license">在
把意見不合變成公開爭論之前要先深入思考。如果有必要，請求調解，並嘗試在比較不會高度情緒化的媒介上來解決分歧。如果你覺得你或你的成果受到攻擊，在你
寫下憤怒回應之前先慢慢地呼吸。如果發現已在使用情緒性的語言，考慮暫停 24 小時 －
有時候就是需要一段冷靜期。如果你真的想要採取不同的方式，那麼我們建議你發布你的想法和你的成果，讓它可以廣泛被試驗。<br>
</p>
<p class="license">這份文件採用 <a href="http://creativecommons.org/licenses/by-sa/3.0/us/">創用 CC 姓名標示 - 相同方式分享 3.0 授權條款</a> (總部版<a href="http://wiki.mandriva.com/en/Code_of_Conduct" rel="nofollow"></a>)。</p>

</div>
</div>
</div>
</div>

</body></html>