<!DOCTYPE html>
<html dir="ltr" lang="ru">
<head>
    <meta charset="utf-8" />
    <title>Кодекс поведения - Mageia</title>
    <meta name="description" content="Mageia is new community-based Linux distribution." />
    <meta name="keywords" content="mageia, values, conduct, rules" />
    <meta name="author" content="Mageia" />
    <link rel="stylesheet" type="text/css" href="/g/style/all.css" />
    <?php include '../../../analytics.php'; ?>
</head>
<body>
    <?php include '../../../langs.php'; ?>

    <div id="doc" class="yui-t7">
        <div id="hd" role="banner"><h1><a id="logo" href="/"><span>Mageia</span></a> <span class="lsep">|</span> <span class="subh">Кодекс поведения</span></h1></div>
        <div id="bd" role="main">
            <div class="yui-g">
                <div class="para codeofconduct">
                    <div id="preamble">

                    <p>Проект Mageia — это развивающееся сообщество, открытое для всех. Мы хотим, чтобы это сообщество было хорошим местом как для начинающих, так и для давних его членов; местом, где любой чувствует себя комфортно, где принимают каждого, независимо от внесённой им лепты.</p>

                    <p>В Cообществе Mageia собираются вместе участники со всего мира для создания свободной операционной системы. Это возможно благодаря поддержке, усердной работе и энтузиазму тысяч людей, как создателей и пользователей Mageia, так и других людей, занятых разработкой Свободного Программного Обеспечения.</p>

                    <p>Этот документ предоставляет некоторые рекомендации для создания позитивной и воодушевляющей атмосферы эффективной совместной работы и объясняет, как мы можем помочь друг другу.</p>

                    <p>Данный Кодекс поведения является общим для всех участников и пользователей проекта Mageia, и его общественных служб.</p>
                    </div>
                    
                    <div id="overview">
                    <h2 class="be">Обзор</h2>

                    <p>Данный Кодекс поведения представляет сумму общих ценностей и "здравомыслия" нашего сообщества. Основные нравственные предписания, которые поддерживают нашу целостность: </p>
                    <ul>
                        <li><a href="#be_considerate">Внимание</a>,</li>
                        <li><a href="#be_respectful">Уважение</a>,</li>
                        <li><a href="#be_collaborative">Сотрудничество</a>,</li>
                        <li><a href="#be_pragmatic">Практичность</a>,</li>
                        <li><a href="#support">Поддержка других членов сообщества</a>,</li>
                        <li><a href="#get_support">Получение помощи у сообщества</a>.</li>
                    </ul>
                    
                    <p>Кодекс отражает общепринятые стандарты поведения членов сообщества Mageia на форумах, в списках рассылки, на вики, сайтах, каналах IRC, на публичных конференциях или в частной переписке касаемо проекта Mageia и предоставляемых им сервисов. Сообщество обязано действовать согласно этим стандартам и защищать их для собственного блага. Руководители любой команды Mageia оставляют за собой право приостановить доступ любого нарушителя нашего общего Кодекса поведения. При необходимости такие случаи принимает к рассмотрению и выносит окончательные решения Совет Mageia.</p>
                    </div>

                    <h2 id="be_considerate" class="be">Внимание.</h2>

                    <p>Ваша работа будет использована другими людьми, а вы, в свою очередь, будете использовать их труд. Любое принятое вами решение так или иначе повлияет на других членов сообщества. Мы ожидаем, что вы будете принимать во внимание последствия своих решений.</p>

                    <p>Если вы вносите свой вклад в сообщество, убедитесь, что вы полностью отдаёте должное работе других и помните о влиянии вашего вклада. От вас также ожидается следование графику и принципам проекта.</p>

                    <p>Если вы являетесь пользователем, помните, что участники сообщества усердно работают, чтобы с гордостью внести свою лепту. Если вас что-то не устраивает, скорее всего вашу проблему можно решить при условии предоставления вами точной и корректной информации всем заинтересованным участникам.</p>

                    <h2 id="be_respectful" class="be">Уважение.</h2>

                    <p>Для существования здорового сообщества его члены должны чувствовать комфорт и востребованность. Для этого абсолютно необходимо взаимоуважение. Если возникаю разногласия, сперва примите тот факт, что люди желают добра.</p>

                    <p>Мы не потерпим личных оскорблений, расизма, сексизма, или любой другой формы дискриминации. Разногласия неизбежны с течением времени,  но проявляйте уважение к точке зрения других, и, со временем, они начнут проявлять такое же уважение к вашей. Проявление уважения к взглядам других людей, их работе и вкладе в сообщество принесёт комфорт и чувство безопасности членам сообщества, и послужит увеличению продуктивности и мотивации.</p>

                    <p>Мы ожидаем, что члены сообщества будут с уважением относится к пользователям и участникам других сообществ. Помните, что сообщество Mageia интернационально, и вы можете быть не в курсе важных составляющих других культур. </p>

                    <h2 id="be_collaborative" class="be">Сотрудничество.</h2>

                    <p>Движение Свободного Программного Обеспечения зависит от сотрудничества: оно помогает устранить повторную работу на благо производимого продукта. Чтобы избежать непонимания, постарайтесь, чтобы ваши просьбы или предложения помощи были ясными и чёткими. Помните, что сообщения электронной почту могут быть поняты вами неправильно (особенно, если они написаны на не родном вам языке). Запрашивайте уточнения, если вам что-то непонятно, и помните о том, что люди желают вам добра.</p>

                    <p>Вашей целью как участника, вносящего вклад в сообщество, должно быть сотрудничество, как с другими участниками, так и со сторонними сообществами (например, в вышестоящих проектах), которые зависят от вашей работы, или заинтересованы в ней. Ваша работа должна быть прозрачна для сообщества и возвращаться в него так скоро, как только возможно (даже если она не польностью завершена). Если вы желаете заняться новой работой в существующих проектах, информируйте команды этих проектов о ваших желаниях и ходе работы.</p>

                    <p>В процессе внедрения идеи не всегда возможен консенсус, так что не чувствуйте себя обязанным достичь его перед началом работы. Однако, всегда информируйте сообщество о своей работе и публикуйте её в такой форме, которая позволяет проверить, обсудить и улучшить плоды вашего труда.</p>

                    <p>Участники любого проекта приходят и уходят. Когда вы покидаете проект, частично или полностью, вы должны делать это с чувством гордости за проделанную работу, и с ответственностью подходить к тем, кто придёт после вас для продолжения работы над проектом.</p>

                    <p>Ваши отзывы как пользователя так же важны, как и их форма. Плохо сформулированные комментарии могут причинить боль и демотивировать других членов сообщества, а обсуждение проблем с взаимоуважением принесут положительные результаты. Поощрение творит чудеса.</p>


                    <h2 id="be_pragmatic" class="be">Практичность.</h2>

                    <p>Сообщество Mageia — практичное сообщество.</p>
                    <p>Мы предпочитаем ощутимые результаты последнему слову в обсуждениях. Мы защищаем наши ключевые ценности, такие как свобода и сотрудничество с уважением, но мы не позволяем спорам о мелочах вставать на пути достижения более важных результатов. Мы открыты для предложений, и с радостью принимаем идеи, независимо от их источника. Если вы в сомнениях, поддержите идею, которая решит проблему, а не теоретическое изыскание, не применимое на практике. Используйте методы и инструменты, которые помогут выполнить работу. Предоставьте право выбора тем, кто эту работу выполняет. При возникновении непримиримых разногласий, консультируйтесь с руководством соответствующих команд. При необходимости свяжитесь с Советом Mageia.</p>


                    <h2 id="support" class="be">Поддержка других членов сообщества.</h2>

                    <p>Сила нашего сообщества во взаимоуважении, сотрудничестве и ответственном прагматичном поведении. Иногда эти ценности нуждаются в защите, а другие члены сообщества — в помощи.</p>

                    <p>Если вы стали свидетелем нападения на других членов сообщества, подумайте о том, какую помощь можете оказать им лично вы. Если ситуауция складывается так, что помощь оказать вы не можете, уточните у жертвы, нужно ли официальное вмешательство. Таким же образом вы обязаны поддерживать членов сообщества, которые испытывают угрозу срыва из-за связанного с работой стресса или личных проблем.</p>

                    <p>В конфликтных ситуациях попробуйте напомнить их участникам о нашем общем Кодексе поведения в качестве первичной меры. Лидеры определяются по их действиям, и могут подать хороший пример другим людям, следуя духу Кодекса при разрешени конфликтов.</p>


                    <h2 id="get_support" class="be">Получение помощи у сообщества.</h2>

                    <p>Разногласия, как технические, так и политические, случаются постоянно. И наше сообщество — не исключение. Ваша цель — не избегать конфликтов (или различия точек зрения), а конструктивно устранять их. Вы должны обращаться к сообществу в поисках совета для устранения разногласий, и, где возможно, связываться с командами, имеющим к ним непосредственное отношение.</p>

                    <p>Хорошо подумайте, прежде чем выносить разногласия на публичное обсуждение. При необходимости, устраняйте их, используя наименее эмоциональный способ. Если ваша работа подвергается нападкам, сделайте глубокий вдох перед написанием гневных ответов. При избытке эмоций попробуйте выдержать паузу длинной в сутки, так как иногда всё, что нужно оппонентам — немного остыть. Если же данный путь вас не устраивает, мы ждём ваших предложений.</p>

                    <p class="license">Документ опубликован под лицензией <a href="http://creativecommons.org/licenses/by-sa/3.0/us/">Creative Commons Attribution - Share Alike 3.0 License</a> (<a href="/en/about/code-of-conduct/" rel="nofollow">исходная версия</a>).</p>
                </div>
            </div>
        </div>
    </div>
</body>
</html>
